; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v7 ?v4)
             (pred_7 ?v13 ?v11)
             (pred_5 ?v7 ?v11)
             (pred_12 ?v1 ?v7 )
	     (pred_2 ?v7)
             (pred_8 ?v6)
             (pred_1 ?v13)
             (pred_4 ?v11)
             (pred_9 ?v7)
             (pred_3 ?v13)
             (pred_6 ?v7)
             (pred_10 ))



(:action op_4
:parameters (?v10 ?v2 ?v3 ?v12)
:precondition (and (pred_8 ?v10) (pred_8 ?v2) (pred_1 ?v3) (pred_4 ?v12)
          (pred_11 ?v10 ?v2) (pred_7 ?v3 ?v12)
                   (pred_5 ?v2 ?v12) (pred_2 ?v10) 
                   (pred_9 ?v2) (pred_3 ?v3))
:effect (and  (pred_6 ?v2) (not (pred_9 ?v2))))


(:action op_2
:parameters (?v10 ?v5)
:precondition (and (pred_8 ?v10) (pred_8 ?v5)
               (pred_2 ?v10) (pred_11 ?v10 ?v5) (pred_6 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v10))))

(:action op_3
:parameters (?v10 ?v3)
:precondition (and (pred_8 ?v10) (pred_1 ?v3) 
                  (pred_2 ?v10) (pred_12 ?v3 ?v10) (pred_10 ))
:effect (and (pred_3 ?v3)
   (not (pred_12 ?v3 ?v10)) (not (pred_10 ))))


(:action op_1
:parameters (?v10 ?v9 ?v8)
:precondition (and (pred_8 ?v10) (pred_1 ?v9) (pred_1 ?v8)
                  (pred_2 ?v10) (pred_3 ?v8) (pred_12 ?v9 ?v10))
:effect (and (pred_3 ?v9) (pred_12 ?v8 ?v10)
        (not (pred_3 ?v8)) (not (pred_12 ?v9 ?v10))))

(:action op_5
:parameters (?v10 ?v3)
:precondition (and (pred_8 ?v10) (pred_1 ?v3) 
                  (pred_2 ?v10) (pred_3 ?v3))
:effect (and (pred_10 ) (pred_12 ?v3 ?v10) (not (pred_3 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_16 obj_17 obj_02 obj_13 obj_18 obj_09 obj_10 obj_19 obj_12 obj_20 obj_08 obj_06 obj_07 obj_15 obj_05 obj_11
    obj_14 obj_04
    obj_01 obj_03
    )

    (:init
       (pred_10)

       (pred_8 obj_16)
       (pred_8 obj_17)
       (pred_8 obj_02)
       (pred_8 obj_13)
       (pred_8 obj_18)
       (pred_8 obj_09)
       (pred_8 obj_10)
       (pred_8 obj_19)
       (pred_8 obj_12)
       (pred_8 obj_20)
       (pred_8 obj_08)
       (pred_8 obj_06)
       (pred_8 obj_07)
       (pred_8 obj_15)
       (pred_8 obj_05)
       (pred_8 obj_11)
       (pred_4 obj_14)
       (pred_4 obj_04)
       (pred_1 obj_01)
       (pred_1 obj_03)

       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_17)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_17 obj_02)
       (pred_11 obj_17 obj_16)
       (pred_11 obj_02 obj_10)
       (pred_11 obj_02 obj_13)
       (pred_11 obj_02 obj_17)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_13 obj_02)
       (pred_11 obj_18 obj_12)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_09 obj_20)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_10 obj_08)
       (pred_11 obj_10 obj_19)
       (pred_11 obj_10 obj_02)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_19 obj_06)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_10)
       (pred_11 obj_12 obj_07)
       (pred_11 obj_12 obj_20)
       (pred_11 obj_12 obj_18)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_20 obj_08)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_20 obj_12)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_08 obj_10)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_19)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_07 obj_15)
       (pred_11 obj_07 obj_12)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_15 obj_07)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_11 obj_05)
       (pred_9 obj_12)
       (pred_9 obj_19)
       (pred_5  obj_12 obj_14)
       (pred_5  obj_19 obj_04)
       (pred_6 obj_16)
       (pred_6 obj_17)
       (pred_6 obj_02)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_09)
       (pred_6 obj_10)
       (pred_6 obj_20)
       (pred_6 obj_08)
       (pred_6 obj_06)
       (pred_6 obj_07)
       (pred_6 obj_15)
       (pred_6 obj_05)
       (pred_6 obj_11)

       (pred_7  obj_01 obj_14)
       (pred_7  obj_03 obj_04)
       (pred_12 obj_01 obj_13)
       (pred_12 obj_03 obj_07)
       (pred_2 obj_07)
    )

    (:goal (and
       (pred_12 obj_01 obj_12)
    ))
(:constraints
  (always (not (pred_2 obj_17)))
)
)

; plan
1. (op_2 obj_07 obj_15)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_15)
   goals met: 0 of 1
2. (op_2 obj_15 obj_20)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_20)
   goals met: 0 of 1
3. (op_2 obj_20 obj_09)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_09)
   goals met: 0 of 1
4. (op_2 obj_09 obj_10)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_10)
   goals met: 0 of 1
5. (op_2 obj_10 obj_02)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_02)
   goals met: 0 of 1
6. (op_2 obj_02 obj_13)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_13)
   goals met: 0 of 1
7. (op_3 obj_13 obj_01)
   deleted: (pred_12 obj_01 obj_13) (pred_10)
   added: (pred_3 obj_01)
   goals met: 0 of 1
8. (op_2 obj_13 obj_02)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_02)
   goals met: 0 of 1
9. (op_2 obj_02 obj_10)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_10)
   goals met: 0 of 1
10. (op_2 obj_10 obj_09)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_09)
   goals met: 0 of 1
11. (op_2 obj_09 obj_18)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_18)
   goals met: 0 of 1
12. (op_4 obj_18 obj_12 obj_01 obj_14)
   deleted: (pred_9 obj_12)
   added: (pred_6 obj_12)
   goals met: 0 of 1
13. (op_2 obj_18 obj_12)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_12)
   goals met: 0 of 1
14. (op_5 obj_12 obj_01)
   deleted: (pred_3 obj_01)
   added: (pred_10) (pred_12 obj_01 obj_12)
   goals met: 1 of 1
